# ----- Design Compiler synthesis script for variable sized, registered adder ------ #
# Author: Mike Starr 

## Remove synthesis ghost files via exorcism ##
remove_design -designs

## Load files ##
read_file -format verilog ./transmitter.v
read_file -format verilog ./trans_protocol.v


## Set top-level module
current_design transmitter

## Elaborate
elaborate transmitter

## Check for errors
check_design
exit