# ----- Design Compiler synthesis script for variable sized, registered adder ------ #
# Author: Mike Starr 

## Remove synthesis ghost files via exorcism ##
remove_design -designs

## Load files ##
read_file -format verilog ./receiver.v
read_file -format verilog ./receive_protocol.v


## Set top-level module
current_design receiver

## Elaborate
elaborate receiver

## Check for errors
check_design


exit